Reports/ДвижениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДвижениеНоменклатуры</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ДвижениеНоменклатуры/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	
	Таб = ЭтаФорма.ПолеВывода;
	Таб.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Номенклатура) Тогда
		Возврат;	
	КонецЕсли;
	
	Макет = Отчеты.ДвижениеНоменклатуры.ПолучитьМакет("Макет");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.Регистратор КАК Документ,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСНачальныйОстаток КАК СуммаСНДСНачальныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСКонечныйОстаток КАК СуммаСНДСКонечныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСПриход КАК СуммаСНДСПриход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСРасход КАК СуммаСНДСРасход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдИзм
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровНаСкладах.ОстаткиИОбороты(, &ТекущаяДата, Регистратор, , Номенклатура = &Номенклатура) КАК ОстаткиТоваровНаСкладахОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	обСтрока = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Документ) Тогда
			обСтрока.Параметры.Заполнить(Выборка);
			Таб.Вывести(обСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") Тогда
		ЭтаФорма.Номенклатура = Параметры.Номенклатура;
		НоменклатураПриИзмененииНаСервере();
	
	КонецЕсли;
КонецПроцедуры
